# Importing Dataset

##### importing the dataset by pandas library

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
dataset=pd.read_csv(r"C:\Users\DELL\OneDrive\Documents\CSV Files\multivariate.csv")

In [3]:
dataset

  Experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2      five                     6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [4]:
dataset.shape

(8, 4)

In [5]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 4 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   Experience                  6 non-null      object
 1   test_score(out of 10)       7 non-null      float64
 2   interview_score(out of 10)  8 non-null      int64
 3   salary($)                   8 non-null      int64
dtypes: float64(1), int64(2), object(1)
memory usage: 384.0+ bytes

In [6]:
dataset.columns

Index(['Experience', 'test_score(out of 10)', 'interview_score(out of 10)',
       'salary($)'],
      dtype='object')

In [7]:
dataset.describe()

       test_score(out of 10)  interview_score(out of 10)    salary($)
count               7.000000                    8.000000      8.00000
mean                7.857143                    7.875000  63000.00000
std                 1.345185                    1.642081  11501.55269
min                 6.000000                    6.000000  45000.00000
25%                 7.000000                    6.750000  57500.00000
50%                 8.000000                    7.500000  63500.00000
75%                 8.500000                    9.250000  70500.00000
max                10.000000                   10.000000  80000.00000

# Preparation of the Data

###### we need to convert word  data to the Numeric data and fill some null values by proper matching values

## Lets check weather the dataset contain null values or not

In [8]:
dataset.isna().any()

Experience                     True
test_score(out of 10)          True
interview_score(out of 10)    False
salary($)                     False
dtype: bool

In [9]:
df=dataset.rename(columns={'test_score(out of 10)':'test_score','interview_score(out of 10)':"interview_score"})

In [10]:
df.columns

Index(['Experience', 'test_score', 'interview_score', 'salary($)'], dtype='object')

## Filling the Null Values

In [11]:
median=df['test_score'].median();median

8.0

In [12]:
df=df.fillna({"test_score":median})

In [13]:
df=df.fillna({"Experience":'zero'})
df

  Experience  test_score  interview_score  salary($)
0       zero         8.0                9      50000
1       zero         8.0                6      45000
2      five          6.0                7      60000
3        two        10.0               10      65000
4      seven         9.0                6      70000
5      three         7.0               10      62000
6        ten         8.0                7      72000
7     eleven         7.0                8      80000

In [14]:
#pip install word2number (For converting no of experienced hours into the numbers)

In [15]:
from word2number import w2n

In [16]:
df.Experience=df.Experience.apply(w2n.word_to_num)

In [17]:
df

   Experience  test_score  interview_score  salary($)
0           0         8.0                9      50000
1           0         8.0                6      45000
2           5         6.0                7      60000
3           2        10.0               10      65000
4           7         9.0                6      70000
5           3         7.0               10      62000
6          10         8.0                7      72000
7          11         7.0                8      80000

# Fitting Model

In [18]:
from sklearn.linear_model import LinearRegression

In [19]:
model=LinearRegression()

In [20]:
model.fit(df[["Experience","test_score","interview_score"]],df[["salary($)"]])

LinearRegression()

# Making Predictioins

#### salary prediction

###### 1) 2 year experience, 9 test_score, 6 interview_score

###### 2)12 year experience, 10 test_score, 10 interview score

#### 1)ans:

In [21]:
print("predicted salary of employee is:",model.predict([[2,9,6]]))

predicted salary of employee is: [[53205.96797671]]

#### 2)ans:

In [22]:
print("Predicted salary of the employee is:",model.predict([[12,10,10]]))

Predicted salary of the employee is: [[92002.18340611]]